Revit 2026 API

# RepeatingReferenceSourceGetBounds Method

---

Returns information about the boundaries of the repeating reference array.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public RepeaterBounds GetBounds()
```
```vb
Public Function GetBounds As RepeaterBounds
```
```cpp
public:
RepeaterBounds^ GetBounds()
```
```fsharp
member GetBounds : unit -> RepeaterBounds
```

#### Return Value

RepeaterBounds The bounds of the repeating reference source.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The repeating reference source is no longer valid. |

See the RepeaterBounds structure for more information about repeating reference source bounds.

#### Reference

RepeatingReferenceSource Class

Autodesk.Revit.DB Namespace